Revit 2027 API
StairsRun.SetLocationPathForStraightRun Method
 Set location path for a straight run by giving a line.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool SetLocationPathForStraightRun(
	StairsRun stairsRun,
	Line locationPath
)
Public Shared Function SetLocationPathForStraightRun (
	stairsRun As StairsRun,
	locationPath As Line
) As Boolean
public:
static bool SetLocationPathForStraightRun(
	StairsRun^ stairsRun,
	Line^ locationPath
)
static member SetLocationPathForStraightRun :
        stairsRun : StairsRun *
        locationPath : Line -> bool
Parameters
stairsRun StairsRun
 The run whose location path will be set.
locationPath Line
 The location path.
Return Value
Boolean
 Indicate if set is success or not.
Exceptions
Exception | Condition
ArgumentException |  The input locationPath is not a bound line. -or- The input locationPath is not a valid location path line for straight run. -or- The locationPath is not valid line used as stairs path(probably it's too short).
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The stairs element represented by stairsRun is not in an active StairsEditScope. The run cannot be modified.
RegenerationFailedException |  The locationPath doesn't satisfy restrictions to generate straight run.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace